from environ_vars import *

class Messages:
    START = """سلام 🤗

💬 اگه حرفی درباره بخش کامپیوتر، از انتقاد به گریدرا و استادا تا گله و شکایت درباره انتخاب واحد و غیره داری، یا اگه چیزی تو دلت مونده ولی نمیخوای به صورت مستقیم بیانش کنی، میتونی پیامتو برای من یا [سایتمون]({}) بفرستی تا به صورت ناشناس داخل کانال قرار بگیره.

📬 اگه پیشنهاد، انتقاد یا هر نظری نسبت به بات و کانال داری، داخل بات میتونی با استفاده از دستور /admin اونو به ادمین منتقل کنی. ♥️

🌐 سورس بات:
https://github.com/ar-ekt/IncognitoBot

🌐 {}
🤖 @{}
🆔 @{}""".format(WEB_URL, WEB_URL, BOT_NAME, CHANNEL_NAME)
    
    HELP ="""ℹ️ من هیچ کدوم از اطلاعات فرستنده رو ذخیره نمیکنم و فقط متن پیام برام مهمه.
ℹ️ پیام‌ها قبل اینکه داخل کانال قرار بگیرن توسط ادمین چک میشن، پس لطفا پیام‌هایی که می‌فرستید حاوی الفاظ رکیک و زننده نباشه!
ℹ️ اگه به من شک داری (😒) یا به هر دلیلی با من حال نمیکنی و نمیخوای پیامتو برای من بفرستی، میتونی از طریق [سایتمون]({}) هم پیامتو بفرستی تو کانال.
〰️〰️〰️〰️〰️〰️〰️〰️〰️

/send  |  ارسال پیام به کانال
◉ با این دستور میتونی پیامی که میخوای داخل کانال به صورت ناشناس گذاشته شه رو برای من بفرستی.
◉ فقط کافیه بعد از این دستور پیامتو برام ارسال کنی.


/reply  |  ریپلای به یکی از پیامای کانال
◉ با این دستور میتونی به یکی از پیامای داخل کانال به صورت ناشناس ریپلای کنی.
◉ فقط کافیه بعد از ارسال این دستور پیامی که میخوای داخل کانال بهش ریپلای کنی رو برام فوروارد کنی و بعدشم پیام خودتو بفرستی.


/admin  |  ارسال پیام به ادمین
◉ با این دستور میتونی به صورت ناشناس به ادمین پیام بدی.
◉ فقط کافیه بعد از ارسال این دستور پیامتو برام بفرستی.
◉ ادمین پیامی که از این طریق براش فرستاده بشه رو داخل کانال قرار نمیده.

〰️〰️〰️〰️〰️〰️〰️〰️〰️

📬 اگه پیشنهاد، انتقاد یا هر نظری نسبت به من و کانال داری میتونی با استفاده از دستور /admin اونو به ادمین منتقل کنی. ♥️

🌐 {}
🤖 @{}
🆔 @{}""".format(WEB_URL, WEB_URL, BOT_NAME, CHANNEL_NAME)
    
    CANCEL_MESSAGE = "لغو پیام ❌"
    SEND_MESSAGE = "ارسال پیام 📤"
    
    UNRECOGNIZED_COMMAND = "🤨 داري اشتباه ميزني!"
    
    class CancelCommand:
        DONE = "❌ کامند /{} لغو شد\n" \
                "برای اینکه لیست کامندها رو ببینی، کامند /help رو بفرس"
        ERROR = "❌ هيچ کامندي فعال نيست"
    
    class SendCommand:
        START = "✉ پیامت رو بفرس"
        SURE = "❓ مطمئنی میخوای این پیامو بفرستی؟"
        DONE = "📬‌ پیامت ذخیره شد، منتظر باش تا ادمین تاییدش کنه و توی کانال قرار بگیره"
        CANCEL = "❌ ارسال پيام لغو شد"
    
    class AdminCommand:
        START = "👤 پیامت به ادمین رو بفرس"
        SURE = "❓ مطمئنی میخوای این پیامو بفرستی؟"
        DONE = "📬‌ پیامت برای ادمین ارسال شد"
        CANCEL = "❌ ارسال پيام لغو شد"
    
    class ReplyCommand:
        START = "↩ پیامی که میخوای داخل کانال بهش ریپلای کنی رو اینجا فوروارد کن"
        MESSAGE = "✉ پیامت رو بفرس"
        SURE = "❓ مطمئنی میخوای این پیامو بفرستی؟"
        DONE = "📬‌ پیامت ذخیره شد، منتظر باش تا ادمین تاییدش کنه و توی کانال قرار بگیره"
        CANCEL = "❌ ارسال پيام لغو شد"
        ERROR = "⛔ از @{} فوروارد کن"
    
    class ChannelMessage:
        FORMAT = "{{}}\n\n[کانال](https://t.me/{}) ¤ [بات](https://t.me/{}) ¤ [سایت]({})".format(CHANNEL_NAME, BOT_NAME, WEB_URL)
        LINK = "https://t.me/{}/{}"
    
    class MessageMenu:
        SEND_TO_CHANNEL = "ارسال به کانال 📤"
        REJECT = "رد کردن 🙅‍♂"
        REPLYED_MESSAGE = "پیام ریپلای 🔗"
        
        REJECT_DONE = "❌ پیام رد شد"
        SEND_TO_CHANNEL_DONE = "✅ پيام با موفقيت به کانال فرستاده شد"
        
        REJECT_STATE = "{}\n\n❌ ردشده ❌"
        Send_TO_CHANNEL_STATE = "{}\n\n✅ فرستاده‌شده ✅"